[
    {
        "id": "I&C SCI 3",
        "name": "Internet Technologies and their Social Impact",
        "units": "4",
        "description": "Examines current Internet technologies and social implications at the individual, group, and societal level. Blogs, wikis, sharing of video, photos, and music, e-commerce, social networking, gaming, and virtual environments. Issues include privacy, trust, identity, reputation, governance, copyright, and malicious behavior.",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 4",
        "name": "Human Factors for the Web",
        "units": "4",
        "description": "Principles of human-computer interaction in evaluating, designing, and developing information presented on the World Wide Web. User characteristics, usability analysis, navigation and organization. Color, typography, multimedia, information visualization, prototyping, user studies, evaluation strategies. Web accessibility.",
        "prereqString": "",
        "restriction": "Restriction: May not be taken for credit after IN4MATX 131.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 5",
        "name": "Global Disruption and Information Technology",
        "units": "4",
        "description": "Explores how new forms of information technology may support transition to a sustainable civilization. Topics include design and implementation of IT systems, science of global change, online community building, and “green IT”. Activities involve reading, writing, discussion, and final project.",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 6B",
        "name": "Boolean Logic and Discrete Structures",
        "units": "4",
        "description": "Relations and their properties",
        "prereqString": "Prerequisite: High school mathematics through trigonometry.\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 6D",
        "name": "Discrete Mathematics for Computer Science",
        "units": "4",
        "description": "Covers essential tools from discrete mathematics used in computer science with an emphasis on the process of abstracting computational problems and analyzing them mathematically. Topics include mathematical induction, combinatorics, and recurrence relations.",
        "prereqString": "Prerequisite: Recommended: I&C SCI 6B\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment. Computer Engineering majors have second consideration.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 6N",
        "name": "Computational Linear Algebra",
        "units": "4",
        "description": "Matrices and linear transformations, systems of linear equations, determinants, linear vector spaces, eigenvalues and eigenvectors, orthogonal matrices, diagonalization, and least squares. Topics taught primarily from an algorithmic perspective, including computational solutions, applications, and numerical error analysis.",
        "prereqString": "Prerequisite: I&C SCI 31 or I&C SCI 32A or AP Computer Science A. AP Computer Science A with a minimum score of 3\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 7",
        "name": "Spreadsheets for Problem-Solving",
        "units": "4",
        "description": "Features useful tools for building, solving, analyzing, and visualizing computational models in diverse areas. Covered features include data entry and protection",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 10",
        "name": "How Computers Work",
        "units": "4",
        "description": "Introduction to digital computer and communication systems. Capabilities and limitations of information technology. Representing information in digital form. Overview of computer organization, internet, operating systems, software. Human-computer interaction and social impact.",
        "prereqString": "",
        "restriction": "Restriction: May not be taken for credit after I&C SCI 31, I&C SCI 32, I&C SCI 32A, I&C SCI 51, I&C SCI 105, or IN4MATX 43. ",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 11",
        "name": "The Internet and Public Policy",
        "units": "4",
        "description": "How the Internet works. Current public policy issues concerning the Internet. Introductory economics. Communications law. Interactions between information technology, economics, and law. Case studies about Internet and communications policy.",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 20",
        "name": "Invitation to Computing",
        "units": "4",
        "description": "Foundational principles of computer science for students with no computing background that are interested in a related career. Big ideas of computing explored, including programming through use of sequential, conditional, iterative logic. Good computational practices, problem solving, and organization discussed.",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 31",
        "name": "Introduction to Programming",
        "units": "4",
        "description": "Introduction to fundamental concepts and techniques for writing software in a high-level programming language. Covers the syntax and semantics of data types, expressions, exceptions, control structures, input/output, methods, classes, and pragmatics of programming.",
        "prereqString": "",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 32",
        "name": "Programming with Software Libraries",
        "units": "4",
        "description": "Construction of programs for problems and computing environments more varied than in I&C SCI 31. Using library modules for applications such as graphics, sound, GUI, database, Web, and network programming. Language features beyond those in I&C SCI 31 are introduced as needed.",
        "prereqString": "Prerequisite: I&C SCI 31 or CSE 41. I&C SCI 31 with a grade of C or better. CSE 41 with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 32A",
        "name": "Python Programming and Libraries (Accelerated)",
        "units": "4",
        "description": "Introduces Python syntax and semantics for fundamental programming concepts.  Constructing programs for varied problems and environments. Using library modules for applications such as graphics, sound, GUI, database, Web, and network programming. Accelerated course for students with previous programming background.",
        "prereqString": "Prerequisite: AP Computer Science A. AP Computer Science A with a minimum score of 3. Placement via a transfer course in computer programming or equivalent experience may also be accepted upon review.\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 33",
        "name": "Intermediate Programming",
        "units": "4",
        "description": "Intermediate-level language features and programming concepts for larger, more complex, higher-quality software. Functional programming, name spaces, modules, class protocols, inheritance, iterators, generators, operator overloading, reflection. Analysis of time and space efficiency.",
        "prereqString": "Prerequisite: I&C SCI 32 or CSE 42 or I&C SCI 32A. I&C SCI 32 with a grade of C or better. CSE 42 with a grade of C or better. I&C SCI 32A with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 45C",
        "name": "Programming in C/C++ as a Second Language",
        "units": "4",
        "description": "An introduction to the lexical, syntactic, semantic, and pragmatic characteristics of the C/C++ languages for experienced programmers. Emphasis on object-oriented programming, using standard libraries, and programming with manual garbage collection.",
        "prereqString": "Prerequisite: I&C SCI 33 or CSE 43 or EECS 40. I&C SCI 33 with a grade of C or better. CSE 43 with a grade of C or better. EECS 40 with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 45J",
        "name": "Programming in Java as a Second Language",
        "units": "4",
        "description": "An introduction to the lexical, syntactic, semantic, and pragmatic characteristics of the Java language for experienced programmers. Emphasis on object-oriented programming, using standard libraries, and programming with automatic garbage collection.",
        "prereqString": "Prerequisite: I&C SCI 33 or CSE 43. I&C SCI 33 with a grade of C or better. CSE 43 with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment. I&C SCI 45J may not be taken for credit after I&C SCI 22, I&C SCI 23, or CSE 23.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 46",
        "name": "Data Structure Implementation and Analysis",
        "units": "4",
        "description": "Focuses on implementation and mathematical analysis of fundamental data structures and algorithms. Covers storage allocation and memory management techniques.",
        "prereqString": "Prerequisite: CSE 45C or I&C SCI 45C. CSE 45C with a grade of C or better. I&C SCI 45C with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 51",
        "name": "Introductory Computer Organization",
        "units": "6",
        "description": "Multilevel view, design, and operation of computer system components. Machine-level data and instruction representation. Instruction sets and addressing modes. Memory organization. Laboratory work using low-level programming languages.",
        "prereqString": "Prerequisite: I&C SCI 33 and I&C SCI 6B\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 53",
        "name": "Principles in System Design",
        "units": "4",
        "description": "Introduces basic principles of system software: operating systems, compilers, and networking. Exposure to the following topics through theoretical and practical programming experiences: linking and loading, process and memory management, concurrency and synchronization, network communication, programming for performance, etc.",
        "prereqString": "Corequisite: I&C SCI 53L\nPrerequisite: I&C SCI 46 and I&C SCI 51. I&C SCI 46 with a grade of C or better. I&C SCI 51 with a grade of C or better\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 53L",
        "name": "Principles in System Design Laboratory",
        "units": "2",
        "description": "Required laboratory section and corequisite for I&C SCI 53.",
        "prereqString": "Corequisite: I&C SCI 53\nPrerequisite: I&C SCI 51\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 60",
        "name": "Games and Society",
        "units": "4",
        "description": "The study and critical analysis of computer games as art objects, cultural artifacts, gateways to virtual worlds, educational aids, and tools for persuasion and social change. Emphasis on understanding games in their historical and cultural context.  Materials fee.",
        "prereqString": "",
        "restriction": "Restriction: Computer Game Science Majors have first consideration for enrollment. Game Design and Interactive Media students have first consideration for enrollment. School of ICS majors have second right of consideration.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 61",
        "name": "Game Design Fundamentals",
        "units": "4",
        "description": "Explore the fundamentals of game design through the design and play of simple analog game systems. Students explore the principles and usage of game design elements through hands-on projects emphasizing iteration and playtesting in a creative game design community.",
        "prereqString": "",
        "restriction": "Restriction: Computer Game Science Majors have first consideration for enrollment. Game Design and Interactive Media students have first consideration for enrollment. School of ICS majors have second right of consideration",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 62",
        "name": "Game Technologies and Interactive Media",
        "units": "4",
        "description": "Technologies for interactive media and game design. Web-based software systems, virtual world platforms, and game engines. Emphasis is on conceptual and architectural aspects of these technologies.",
        "prereqString": "Prerequisite: I&C SCI 31 or I&C SCI 32A\n",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 80",
        "name": "Special Topics in Information and Computer Science",
        "units": "2-4",
        "description": "Studies in selected areas of information and computer sciences. Topics addressed vary each quarter.",
        "prereqString": "Prerequisite: Prerequisites vary. \n",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 90",
        "name": "New Students Seminar",
        "units": "1",
        "description": "Introduces students to the Donald Bren School of Information and Computer Sciences. Focuses on advising students making the transition to UCI, community building, and mostly surveying the technical areas within departments in ICS, via talks by faculty on their research.",
        "prereqString": "",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 139W",
        "name": "Critical Writing on Information Technology",
        "units": "4",
        "description": "Study and practice of critical writing and oral communication as it applies to information technology. Each student writes assignments of varying lengths, totaling at least 4,000 words.",
        "prereqString": "Prerequisite: Satisfactory completion of the Lower-Division Writing requirement.\n",
        "restriction": "Restriction: Upper-division students only. School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 161",
        "name": "Game Engine Lab",
        "units": "4",
        "description": "The use of an open source game or graphics engine in the design and implementation of a computer game. Principles of game engine design. Students work on teams to design, implement, and evaluate new computer games based on an engine.",
        "prereqString": "Prerequisite: I&C SCI 45C or CSE 45C\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 162",
        "name": "Modeling and World Building",
        "units": "4",
        "description": "Use of 3D modeling software and related tools to design and create animated, textured models, and expansive virtual worlds incorporating objects, scenes, and venues for activity within game worlds and online environments.",
        "prereqString": "",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 163",
        "name": "Mobile and Ubiquitous Games",
        "units": "4",
        "description": "Design and technology of mobile games, including mixed reality gaming, urban games, and locative media. Case studies of significant systems. Uses and limitations of location-based technologies. Infrastructures and their relationships to gameplay and design.",
        "prereqString": "Prerequisite: I&C SCI 61 and (I&C SCI 10 or I&C SCI 31 or I&C SCI 32A)\n",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 166",
        "name": "Game Design",
        "units": "4",
        "description": "Game design takes into consideration psychology, narrative, platform features and limitations, marketing, computer science capabilities, human-computer interface principles, industry trends, aesthetic judgment, and other factors. Students focus on video game design through lectures, readings, presentations, implementation, and play testing.",
        "prereqString": "Prerequisite: I&C SCI 61 and IN4MATX 43\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Game Science Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 167",
        "name": "Multiplayer Game Systems",
        "units": "4",
        "description": "Foundations and technologies that enable multiuser, networked, and persistent virtual environments. Emphasis on database design and management, network protocols, and concurrency control to accommodate large numbers of simultaneous users.",
        "prereqString": "Prerequisite: I&C SCI 51\n",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Game Science Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 168",
        "name": "Multiplayer Game Project",
        "units": "4",
        "description": "Design and develop a multiplayer game using Unity or similar engine, with a focus on learning to work in a development team, writing design documents, working with platform features and limitations, developing engaging mechanics, playtesting, and post-mortems.",
        "prereqString": "Prerequisite: GDIM 27 and GDIM 33 and GDIM 51 and GDIM 61. GDIM 27 with a grade of C or better. GDIM 33 with a grade of C or better\n",
        "restriction": "Restriction: Computer Game Science Majors have first consideration for enrollment. Game Design and Interactive Media students have first consideration for enrollment. School of ICS majors are given second consideration.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 169A",
        "name": "Capstone Game Project I",
        "units": "4",
        "description": "Students work in teams to design and implement a unique game or interactive experience. Emphasis on sound, art, and level design, building a community, production values, full utilization of hardware and software platform, and current industry trends.",
        "prereqString": "Prerequisite: I&C SCI 168 or (GDIM 131 and GDIM 161). GDIM 161 with a grade of C or better\n",
        "restriction": "Restriction: Seniors only. Computer Game Science Majors have first consideration for enrollment. Game Design and Interactive Media students have first consideration for enrollment. School of ICS majors given second right of consideration.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 169B",
        "name": "Capstone Game Project II",
        "units": "4",
        "description": "Students continue work in teams to design and implement a unique game or interactive experience. Emphasis on sound, art, and level design, building a community, production values, full utilization of hardware and software platform, and current industry trends.",
        "prereqString": "Prerequisite: GDIM 167A or I&C SCI 169A. GDIM 167A with a grade of C or better. I&C SCI 169A with a grade of C or better. In Progress grade for GDIM 167A or I&C SCI 169A also accepted.\n",
        "restriction": "Restriction: Seniors only. Computer Game Science Majors have first consideration for enrollment. Game Design and Interactive Media students have first consideration for enrollment. School of ICS majors given second right of consideration.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 192",
        "name": "Industrial or Public Sector Field Study",
        "units": "2-4",
        "description": "Students participate in an off-campus, supervised internship for a minimum of 60 hours. Students apply classroom knowledge through internship projects in the private sector or nonprofit agencies.",
        "prereqString": "",
        "restriction": "Restriction: School of Info & Computer Sci students have first consideration for enrollment. Computer Science Engineering Majors have first consideration for enrollment.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 193",
        "name": "Tutoring in ICS",
        "units": "2",
        "description": "Principles and practice of providing technical assistance to novice learners in information and computer sciences.",
        "prereqString": "",
        "restriction": "Restriction: ICS Peer Tutoring Program students only.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI H197",
        "name": "Honors Seminar",
        "units": "2",
        "description": "An overview of computer science and selected recent trends in research. Students attend talks on current faculty research, with opportunities for discussion.",
        "prereqString": "",
        "restriction": "Restriction: Bren School of ICS Honors students only. Campuswide Honors Collegium students only.",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 398A",
        "name": "Teaching Assistant Training Seminar",
        "units": "2",
        "description": "Theories, methods, and resources for teaching computer science at the university level, particularly by teaching assistants. Classroom presentations, working with individuals, grading, motivating students. Participants will give and critique presentations and may be videotaped while teaching.",
        "prereqString": "",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 398B",
        "name": "Advanced Teaching Assistant Seminar",
        "units": "4",
        "description": "Teaching computer science at the university level, emphasizing issues in teaching an entire course. Course organization, designing examinations and projects, grading, motivating students. Participants will begin to assemble teaching portfolios.",
        "prereqString": "Prerequisite: I&C SCI 398A\n",
        "restriction": "",
        "prereq": [],
        "next": [],
        "quarter": 0
    },
    {
        "id": "I&C SCI 399",
        "name": "University Teaching",
        "units": "4",
        "description": "Involves on-the-job experience for Teaching Assistants.",
        "prereqString": "",
        "restriction": "Restriction: Teaching assistants only. ",
        "prereq": [],
        "next": [],
        "quarter": 0
    }
]